/**
 * Created by zx on 17-7-26.
 */

city = {
    'HOT': ['北京', '武汉', '广州', '上海', '深圳', '成都', '天津', '重庆', '郑州', '杭州'],
    'W': ['万宁', '潍坊', '威海', '渭南', '文昌', '文山', '温州', '乌海', '武汉', '芜湖', '五家渠', '乌兰察布', '乌鲁木齐', '武威', '无锡', '吴忠', '梧州'],
    'P': ['盘锦', '攀枝花', '平顶山', '平凉', '萍乡', '普洱', '莆田', '濮阳'],
    'R': ['日照'],
    'Q': ['黔东南', '潜江', '黔南', '黔西南', '青岛', '庆阳', '清远', '秦皇岛', '钦州', '琼海', '齐齐哈尔', '泉州', '曲靖', '衢州'],
    'K': ['开封', '喀什', '克拉玛依', '库尔勒', '昆明'],
    'C': ['沧州', '长春', '常德', '昌吉', '昌江', '长沙', '长治', '常州', '朝阳', '潮州', '承德', '成都', '郴州', '赤峰', '池州', '重庆', '崇左', '楚雄', '滁州'],
    'D': ['大理', '大连', '儋州', '丹东', '大庆', '大同', '达州', '德宏', '登封', '德阳', '德州', '定西', '东方', '东莞', '东营'],
    'M': ['马鞍山', '茂名', '眉山', '梅州', '绵阳', '牡丹江'],
    'L': ['来宾', '莱芜', '廊坊', '兰州', '拉萨', '乐山', '凉山', '连云港', '聊城', '辽阳', '辽源', '丽江', '临沧', '临汾', '临高', '临夏', '临沂', '丽水', '六安', '六盘水', '柳州', '陇南', '龙岩', '娄底', '吕梁', '漯河', '洛阳', '泸州'],
    'X': ['厦门', '西安', '湘潭', '湘西', '襄阳', '咸宁', '仙桃', '咸阳', '孝感', '锡林郭勒', '兴安盟', '邢台', '西宁', '新密', '新乡', '信阳', '新余', '忻州', '西双版纳', '宣城', '许昌', '徐州'],
    'A': ['安康', '安庆', '鞍山', '安顺', '安阳'],
    'E': ['鄂尔多斯', '阿克苏', '恩施', '鄂州'],
    'H': ['哈尔滨', '海东', '海口', '海南州', '海西', '哈密', '邯郸', '杭州', '汉中', '鹤壁', '河池', '合肥', '鹤岗', '黑河', '衡水', '衡阳', '河源', '菏泽', '贺州', '红河', '淮安', '淮北', '怀化', '淮南', '黄冈', '黄山', '黄石', '呼和浩特', '惠州', '葫芦岛', '呼伦贝尔', '湖州'],
    'Y': ['雅安', '延安', '延边', '盐城', '阳江', '阳泉', '扬州', '烟台', '宜宾', '宜昌', '伊春', '宜春', '伊犁', '银川', '营口', '鹰潭', '益阳', '永州', '岳阳', '玉林', '榆林', '运城', '云浮', '玉溪'],
    'F': ['防城港', '佛山', '抚顺', '阜新', '阜阳', '抚州', '福州'],
    'B': ['白城', '百色', '白山', '白银', '保定', '宝鸡', '保山', '包头', '巴彦淖尔', '巴中', '北海', '北京', '蚌埠', '本溪', '毕节', '滨州', '亳州'],
    'S': ['三门峡', '三明', '三亚', '上海', '商洛', '商丘', '上饶', '汕头', '汕尾', '韶关', '绍兴', '邵阳', '沈阳', '深圳', '石河子', '石家庄', '十堰', '石嘴山', '双鸭山', '朔州', '四平', '松原', '绥化', '遂宁', '随州', '宿迁', '宿州', '苏州'],
    'T': ['塔城', '泰安', '太原', '泰州', '台州', '唐山', '天津', '天门', '天水', '铁岭', '铜川', '通化', '通辽', '铜陵', '铜仁', '吐鲁番'],
    'J': ['佳木斯', '吉安', '江门', '焦作', '嘉兴', '嘉峪关', '揭阳', '吉林', '济南', '金昌', '晋城', '景德镇', '荆门', '荆州', '金华', '济宁', '晋中', '锦州', '九江', '酒泉', '鸡西', '济源'],
    'Z': ['枣庄', '张家界', '张家口', '张掖', '漳州', '湛江', '肇庆', '昭通', '郑州', '镇江', '中山', '中卫', '周口', '舟山', '珠海', '驻马店', '株洲', '淄博', '自贡', '资阳', '遵义'],
    'G': ['甘南', '赣州', '甘孜', '巩义', '广安', '广元', '广州', '贵港', '桂林', '贵阳', '固原'],
    'N': ['南昌', '南充', '南京', '南宁', '南平', '南通', '南阳', '内江', '宁波', '宁德']
};


