/**
 * Created by zx on 17-7-26.
 */


dct = {

    '拉萨': [
        '城关区'
    ],
    '天门': [
        '天门市'
    ],
    '铜川': [
        '王益区',
        '耀州区'
    ],
    '黔南': [
        '都匀市',
        '贵定县',
        '瓮安县',
        '独山县',
        '罗甸县',
        '龙里县'
    ],
    '商丘': [
        '梁园区',
        '民权县',
        '宁陵县',
        '睢县',
        '睢阳区',
        '虞城县',
        '柘城县'
    ],
    '漳州': [
        '东山县',
        '龙海市',
        '龙文区',
        '平和县',
        '漳州市',
        '芗城区',
        '云霄县',
        '漳浦县',
        '长泰县',
        '诏安县'
    ],
    '池州': [
        '东至县',
        '贵池区',
        '青阳县'
    ],
    '登封': [
        '登封市'
    ],
    '大庆': [
        '红岗区',
        '龙凤区',
        '让胡路区',
        '萨尔图区'
    ],
    '甘南': [
        '合作市',
        '夏河县'
    ],
    '无锡': [
        '北塘区',
        '滨湖区',
        '崇安区',
        '惠山区',
        '江阴市',
        '南长区',
        '无锡市',
        '新区',
        '锡山区',
        '宜兴市'
    ],
    '赤峰': [
        '敖汉旗新惠镇',
        '红山区',
        '喀喇沁旗锦山镇',
        '松山区',
        '翁牛特旗乌丹镇'
    ],
    '德宏': [
        '芒市'
    ],
    '阜阳': [
        '阜南县',
        '临泉县',
        '太和县',
        '颍泉区',
        '颍上县',
        '颍州区'
    ],
    '石嘴山': [
        '大武口区',
        '惠农区',
        '平罗县'
    ],
    '曲靖': [
        '富源县',
        '陆良县',
        '麒麟区',
        '师宗县',
        '宣威市'
    ],
    '吉林': [
        '昌邑区',
        '船营区',
        '丰满区',
        '桦甸市',
        '磐石市',
        '吉林市'
    ],
    '昆明': [
        '安宁市',
        '呈贡区',
        '东川区',
        '官渡区',
        '晋宁县',
        '禄劝彝族苗族自治县',
        '盘龙区',
        '嵩明县',
        '五华区',
        '西山区',
        '寻甸回族彝族自治县',
        '宜良县'
    ],
    '濮阳': [
        '范县',
        '华龙区',
        '濮阳县',
        '清丰县'
    ],
    '宿迁': [
        '沭阳县',
        '泗洪县',
        '泗阳县',
        '宿城区',
        '宿迁市'
    ],
    '普洱': [
        '江城哈尼族彝族自治县',
        '澜沧拉祜族自治县',
        '孟连傣族拉祜族佤族自治县',
        '宁洱哈尼族彝族自治县',
        '思茅区'
    ],
    '百色': [
        '德保县',
        '靖西县',
        '凌云县',
        '平果县',
        '田阳县',
        '西林县',
        '右江区'
    ],
    '儋州': [
        '那大镇区'
    ],
    '济宁': [
        '嘉祥县',
        '金乡县',
        '梁山县',
        '曲阜市',
        '任城区',
        '济宁市',
        '微山县',
        '汶上县',
        '兖州市',
        '邹城市'
    ],
    '营口': [
        '鲅鱼圈区',
        '大石桥市',
        '盖州市',
        '老边区',
        '站前区'
    ],
    '平凉': [
        '崇信县',
        '华亭县',
        '泾川县',
        '静宁县',
        '崆峒区',
        '灵台县'
    ],
    '北海': [
        '银海区',
        '海城区',
        '合浦县'
    ],
    '菏泽': [
        '单县',
        '东明县',
        '巨野县',
        '牡丹区',
        '郓城县'
    ],
    '泰州': [
        '高港区',
        '海陵区',
        '姜堰区',
        '靖江市',
        '泰兴市',
        '泰州市',
        '兴化市'
    ],
    '铜仁': [
        '碧江区',
        '松桃苗族自治县',
        '铜仁市',
        '万山区',
        '玉屏侗族自治县'
    ],
    '巩义': [
        '巩义市'
    ],
    '潮州': [
        '潮安区',
        '潮安县',
        '枫溪区',
        '湘桥区'
    ],
    '资阳': [
        '安岳县',
        '乐至县',
        '雁江区'
    ],
    '延边': [
        '敦化市',
        '珲春市',
        '龙井市',
        '延吉市'
    ],
    '岳阳': [
        '临湘市',
        '湘阴县',
        '岳阳楼区',
        '岳阳县',
        '云溪区'
    ],
    '东方': [
        '东方市'
    ],
    '上饶': [
        '德兴市',
        '广丰县',
        '横峰县',
        '鄱阳县',
        '铅山县',
        '上饶县',
        '万年县',
        '婺源县',
        '信州区',
        '弋阳县',
        '余干县',
        '玉山县'
    ],
    '荆门': [
        '东宝区',
        '掇刀区',
        '京山县',
        '沙洋县',
        '钟祥市'
    ],
    '赣州': [
        '安远县',
        '定南县',
        '赣县',
        '南康市',
        '宁都县',
        '瑞金市',
        '上犹县',
        '石城县',
        '信丰县',
        '兴国县',
        '于都县',
        '章贡区'
    ],
    '深圳': [
        '罗湖区',
        '南山区',
        '福田区',
        '宝安区',
        '光明新区',
        '龙岗区',
        '龙华区',
        '龙华新区',
        '坪山新区',
        '盐田区'
    ],
    '中山': [
        '东凤镇',
        '东区',
        '古镇区',
        '横栏镇',
        '黄圃镇',
        '火炬开发区',
        '南朗镇',
        '南区',
        '三乡镇',
        '沙溪镇',
        '石岐区',
        '中山市',
        '坦洲镇',
        '小榄镇',
        '西区'
    ],
    '驻马店': [
        '平舆县',
        '汝南县',
        '上蔡县',
        '驿城区'
    ],
    '临夏': [
        '康乐县',
        '临夏市',
        '永靖县'
    ],
    '马鞍山': [
        '当涂县',
        '含山县',
        '和县',
        '花山区',
        '雨山区'
    ],
    '嘉峪关': [
        '嘉峪关市'
    ],
    '西安': [
        '灞桥区',
        '碑林区',
        '高陵县',
        '高新区',
        '户县',
        '经开区',
        '蓝田县',
        '莲湖区',
        '临潼区',
        '曲江新区',
        '西安市',
        '未央区',
        '新城区',
        '西咸新区',
        '阎良区',
        '雁塔区',
        '长安区'
    ],
    '邢台': [
        '广宗县',
        '临西县',
        '宁晋县',
        '桥东区',
        '桥西区',
        '沙河市',
        '威县',
        '邢台县'
    ],
    '定西': [
        '安定区',
        '陇西县',
        '岷县',
        '漳县'
    ],
    '河源': [
        '连平县',
        '龙川县',
        '源城区',
        '紫金县'
    ],
    '六盘水': [
        '钟山区',
        '水城县'
    ],
    '湖州': [
        '安吉县',
        '德清县',
        '南浔区',
        '湖州市',
        '吴兴区',
        '长兴县'
    ],
    '商洛': [
        '洛南县',
        '商州区',
        '镇安县',
        '柞水县'
    ],
    'subjects': [

    ],
    '十堰': [
        '丹江口市',
        '房县',
        '茅箭区',
        '郧县',
        '郧西县',
        '张湾区',
        '竹山县',
        '竹溪县'
    ],
    '张掖': [
        '甘州区'
    ],
    '南阳': [
        '邓州市',
        '方城县',
        '内乡县',
        '社旗县',
        '唐河县',
        '宛城区',
        '卧龙区',
        '新野县'
    ],
    '乐山': [
        '峨边彝族自治县',
        '峨眉山市',
        '夹江县',
        '犍为县',
        '井研县',
        '乐山市',
        '五通桥区'
    ],
    '呼伦贝尔': [
        '额尔古纳市',
        '海拉尔区',
        '满洲里市'
    ],
    '伊犁': [
        '奎屯市',
        '伊宁市'
    ],
    '铁岭': [
        '昌图县',
        '调兵山市',
        '开原市',
        '铁岭县',
        '银州区'
    ],
    '武汉': [
        '蔡甸区',
        '东西湖区',
        '汉南区',
        '汉阳区',
        '洪山区',
        '黄陂区',
        '江岸区',
        '江汉区',
        '江夏区',
        '经济技术开发区',
        '硚口区',
        '青山区',
        '武昌区',
        '新洲区'
    ],
    '日照': [
        '东港区',
        '莒县',
        '五莲县'
    ],
    '淮南': [
        '八公山区',
        '凤台县',
        '寿县',
        '田家庵区',
        '谢家集区'
    ],
    '泰安': [
        '肥城市',
        '泰山区',
        '新泰市'
    ],
    '长沙': [
        '芙蓉区',
        '开福区',
        '浏阳市',
        '宁乡县',
        '天心区',
        '望城区',
        '岳麓区',
        '雨花区',
        '长沙县'
    ],
    '许昌': [
        '魏都区',
        '襄城县',
        '鄢陵县',
        '禹州市',
        '长葛市'
    ],
    '景德镇': [
        '浮梁县',
        '乐平市',
        '珠山区'
    ],
    '惠州': [
        '博罗县',
        '大亚湾区',
        '惠城区',
        '惠东县',
        '惠阳区',
        '仲恺高新区'
    ],
    '宣城': [
        '广德县',
        '泾县',
        '郎溪县',
        '宁国市',
        '宣州区'
    ],
    '鹤岗': [
        '萝北县'
    ],
    '铜陵': [
        '铜官山区',
        '义安区',
        '枞阳县'
    ],
    '保定': [
        '定州',
        '阜平县',
        '高碑店市',
        '高阳县',
        '竞秀区',
        '莲池区',
        '满城区',
        '顺平县',
        '唐县',
        '望都县',
        '涿州市'
    ],
    '内江': [
        '东兴区',
        '隆昌县',
        '威远县',
        '资中县'
    ],
    '衡阳': [
        '常宁市',
        '高新区',
        '衡山县',
        '衡阳县',
        '耒阳市',
        '祁东县',
        '石鼓区',
        '雁峰区',
        '蒸湘区',
        '珠晖区'
    ],
    '五家渠': [
        '五家渠市'
    ],
    '台州': [
        '黄岩区',
        '椒江区',
        '临海市',
        '路桥区',
        '三门县',
        '天台县',
        '温岭市',
        '仙居县',
        '玉环县'
    ],
    '河池': [
        '大化瑶族自治县',
        '都安瑶族自治县',
        '凤山县',
        '金城江区',
        '罗城仫佬族自治县',
        '天峨县',
        '宜州市'
    ],
    '兴安盟': [
        '乌兰浩特市'
    ],
    '张家口': [
        '怀来县',
        '桥东区',
        '桥西区',
        '宣化区',
        '张北县'
    ],
    '运城': [
        '河津市',
        '稷山县',
        '临猗县',
        '万荣县',
        '夏县',
        '新绛县',
        '盐湖区',
        '永济市'
    ],
    '固原': [
        '原州区'
    ],
    '安庆': [
        '大观区',
        '怀宁县',
        '开发区',
        '潜山县',
        '宿松县',
        '桐城市',
        '迎江区',
        '宜秀区'
    ],
    '绍兴': [
        '柯桥区',
        '上虞市',
        '越城区',
        '绍兴县',
        '嵊州市',
        '新昌县',
        '诸暨市'
    ],
    '仙桃': [
        '仙桃市'
    ],
    '亳州': [
        '利辛县',
        '蒙城县',
        '谯城区',
        '涡阳县'
    ],
    '邵阳': [
        '北塔区',
        '城步苗族自治县',
        '大祥区',
        '隆回县',
        '邵东县',
        '双清区',
        '武冈市'
    ],
    '红河': [
        '个旧市',
        '建水县',
        '开远市',
        '泸西县',
        '蒙自市',
        '弥勒市'
    ],
    '衡水': [
        '安平县',
        '阜城县',
        '故城县',
        '深州市',
        '桃城区'
    ],
    '烟台': [
        '福山区',
        '海阳市',
        '开发区',
        '莱山区',
        '莱阳市',
        '莱州市',
        '龙口市',
        '牟平区',
        '蓬莱市',
        '招远市',
        '芝罘区'
    ],
    '丹东': [
        '东港市',
        '凤城市',
        '元宝区',
        '振兴区'
    ],
    '鄂州': [
        '鄂城区'
    ],
    '鹤壁': [
        '浚县',
        '淇滨区',
        '淇县',
        '山城区'
    ],
    '长治': [
        '城区',
        '潞城市',
        '平顺县',
        '襄垣县',
        '长治县'
    ],
    '哈尔滨': [
        '阿城区',
        '道里区',
        '道外区',
        '方正县',
        '呼兰区',
        '南岗区',
        '平房区',
        '尚志市',
        '双城市',
        '松北区',
        '香坊区'
    ],
    '宁波': [
        '慈溪市',
        '奉化市',
        '海曙区',
        '江北区',
        '鄞州区',
        '宁海县',
        '江东区',
        '北仑区',
        '象山县',
        '余姚市',
        '镇海区'
    ],
    '厦门': [
        '海沧区',
        '湖里区',
        '集美区',
        '思明区',
        '同安区',
        '翔安区'
    ],
    '南京': [
        '白下区',
        '大厂区',
        '高淳区',
        '鼓楼区',
        '江宁区',
        '建邺区',
        '溧水区',
        '六合区',
        '浦口区',
        '秦淮区',
        '栖霞区',
        '下关区',
        '玄武区',
        '雨花台区'
    ],
    '延安': [
        '宝塔区',
        '富县',
        '黄陵县',
        '洛川县',
        '子长县'
    ],
    '毕节': [
        '毕节市',
        '大方县',
        '金沙县',
        '黔西县',
        '威宁彝族回族苗族自治县',
        '织金县'
    ],
    '太原': [
        '古交市',
        '万柏林区',
        '小店区',
        '杏花岭区',
        '迎泽区'
    ],
    '自贡': [
        '富顺县',
        '荣县',
        '沿滩区',
        '自流井区'
    ],
    '崇左': [
        '扶绥县',
        '江州区',
        '龙州县',
        '宁明县',
        '凭祥市'
    ],
    '临沧': [
        '凤庆县',
        '临翔区',
        '云县'
    ],
    '舟山': [
        '岱山县',
        '定海区',
        '普陀区',
        '嵊泗县'
    ],
    '包头': [
        '东河区',
        '昆都仑区',
        '青山区',
        '包头市',
        '土默特右旗萨拉旗镇'
    ],
    '鄂尔多斯': [
        '达拉特旗',
        '东胜区'
    ],
    '张家界': [
        '慈利县',
        '桑植县',
        '永定区'
    ],
    '连云港': [
        '东海县',
        '赣榆区',
        '灌云县',
        '海州区',
        '连云港市',
        '连云区',
        '新浦区'
    ],
    '防城港': [
        '东兴市',
        '防城区',
        '港口区',
        '上思县'
    ],
    '眉山': [
        '丹棱县',
        '东坡区',
        '洪雅县',
        '彭山县',
        '仁寿县'
    ],
    '塔城': [
        '沙湾县'
    ],
    '雅安': [
        '宝兴县',
        '芦山县',
        '名山区',
        '天全县',
        '荥经县',
        '雨城区'
    ],
    '庆阳': [
        '合水县',
        '环县',
        '宁县',
        '庆城县',
        '西峰区',
        '正宁县'
    ],
    '怀化': [
        '鹤城区',
        '洪江市',
        '麻阳苗族自治县',
        '中方县'
    ],
    '中卫': [
        '沙坡头区',
        '中宁县'
    ],
    '郴州': [
        '安仁县',
        '北湖区',
        '桂阳县',
        '嘉禾县',
        '汝城县',
        '苏仙区',
        '永兴县',
        '资兴市'
    ],
    '泉州': [
        '惠安县',
        '晋江市',
        '鲤城区',
        '南安市',
        '泉港区',
        '丰泽区',
        '安溪县',
        '石狮市',
        '永春县'
    ],
    '咸宁': [
        '赤壁市',
        '崇阳县',
        '通城县',
        '通山县',
        '温泉区',
        '咸安区'
    ],
    '枣庄': [
        '枣庄市',
        '滕州市',
        '薛城区',
        '峄城区'
    ],
    '大同': [
        '城区',
        '浑源县',
        '矿区',
        '南郊区',
        '大同市',
        '阳高县',
        '左云县'
    ],
    '莆田': [
        '城厢区',
        '涵江区',
        '荔城区',
        '仙游县',
        '秀屿区'
    ],
    '酒泉': [
        '阿克塞哈萨克族自治县',
        '敦煌市',
        '瓜州县',
        '金塔县',
        '肃州区'
    ],
    '恩施': [
        '巴东县',
        '恩施市',
        '建始县',
        '来凤县',
        '利川市',
        '咸丰县'
    ],
    '喀什': [
        '喀什市'
    ],
    '唐山': [
        '曹妃甸区',
        '丰南区',
        '丰润区',
        '古冶区',
        '滦南县',
        '滦县',
        '路北区',
        '路南区',
        '迁安市',
        '乐亭县',
        '玉田县',
        '遵化市'
    ],
    '吉安': [
        '安福县',
        '吉水县',
        '吉州区',
        '青原区',
        '遂川县',
        '永丰县'
    ],
    '桂林': [
        '叠彩区',
        '恭城瑶族自治县',
        '秀峰区',
        '灵川县',
        '临桂区',
        '荔浦县',
        '龙胜各族自治县',
        '七星区',
        '象山区',
        '雁山区',
        '永福县'
    ],
    '南平': [
        '光泽县',
        '建瓯市',
        '建阳市',
        '浦城县',
        '邵武市',
        '武夷山市',
        '延平区',
        '政和县'
    ],
    '聊城': [
        '昌府区',
        '茌平县',
        '东阿县',
        '东昌府区',
        '高唐县',
        '冠县',
        '临清市',
        '阳谷县'
    ],
    '鞍山': [
        '海城市',
        '鞍山市',
        '铁东区',
        '铁西区',
        '岫岩满族自治县'
    ],
    '石河子': [
        '石河子市'
    ],
    '威海': [
        '环翠区',
        '火炬高技术产业开发区',
        '经济开发区',
        '荣成市',
        '乳山市',
        '文登区'
    ],
    '西宁': [
        '城北区',
        '城东区',
        '城西区',
        '城中区',
        '大通回族土族自治县'
    ],
    '遂宁': [
        '船山区',
        '大英县',
        '蓬溪县',
        '射洪县'
    ],
    '凉山': [
        '德昌县',
        '会理县',
        '西昌市',
        '冕宁县',
        '越西县'
    ],
    '朔州': [
        '怀仁县',
        '朔城区',
        '应县'
    ],
    '黑河': [
        '爱辉区',
        '北安市',
        '五大连池市'
    ],
    '哈密': [
        '哈密市'
    ],
    '嘉兴': [
        '海宁市',
        '海盐县',
        '嘉善县',
        '南湖区',
        '平湖市',
        '桐乡市',
        '秀洲区'
    ],
    '娄底': [
        '冷水江市',
        '涟源市',
        '娄星区',
        '双峰县',
        '新化县'
    ],
    '黔东南': [
        '凯里市',
        '雷山县',
        '黎平县',
        '麻江县',
        '榕江县',
        '天柱县'
    ],
    '南通': [
        '崇川区',
        '港闸区',
        '海安县',
        '海门市',
        '经济技术开发区',
        '南通市',
        '启东市',
        '如东县',
        '如皋市',
        '通州区'
    ],
    '伊春': [
        '伊春区'
    ],
    '贵阳': [
        '白云区',
        '观山湖区',
        '花溪区',
        '金阳新区',
        '开阳县',
        '南明区',
        '清镇市',
        '乌当区',
        '小河区',
        '修文县',
        '云岩区'
    ],
    '吴忠': [
        '利通区'
    ],
    '开封': [
        '鼓楼区',
        '金明区',
        '兰考县',
        '龙亭区',
        '杞县',
        '开封市',
        '通许县'
    ],
    '贵港': [
        '港北区',
        '桂平市',
        '平南县'
    ],
    '清远': [
        '佛冈县',
        '清城区',
        '英德市'
    ],
    '晋中': [
        '介休市',
        '灵石县',
        '平遥县',
        '祁县',
        '太谷县',
        '榆次区'
    ],
    '临高': [
        '临高县'
    ],
    '锡林郭勒': [
        '二连浩特市',
        '锡林浩特市'
    ],
    '鹰潭': [
        '贵溪市',
        '月湖区',
        '余江县'
    ],
    '渭南': [
        '澄城县',
        '大荔县',
        '富平县',
        '韩城市',
        '临渭区',
        '蒲城县'
    ],
    '梅州': [
        '大埔县',
        '丰顺县',
        '蕉岭县',
        '梅江区',
        '梅县',
        '五华县',
        '兴宁市'
    ],
    '保山': [
        '隆阳区',
        '腾冲市'
    ],
    '温州': [
        '苍南县',
        '乐清市',
        '龙湾区',
        '鹿城区',
        '瓯海区',
        '平阳县',
        '瑞安市',
        '泰顺县',
        '文成县',
        '永嘉县'
    ],
    '六安': [
        '霍邱县',
        '霍山县',
        '金安区',
        '金寨县',
        '舒城县',
        '裕安区'
    ],
    '陇南': [
        '徽县',
        '文县',
        '武都区'
    ],
    '钦州': [
        '灵山县',
        '浦北县',
        '钦南区'
    ],
    '福州': [
        '仓山区',
        '福清市',
        '鼓楼区',
        '晋安区',
        '连江县',
        '罗源县',
        '马尾区',
        '闽侯区',
        '闽侯县',
        '闽清县',
        '平潭县',
        '台江区',
        '永泰县',
        '长乐市'
    ],
    '大连': [
        '中山区',
        '甘井子区',
        '金州区',
        '开发区',
        '旅顺口区',
        '普兰店市',
        '沙河口区',
        '瓦房店市',
        '西岗区',
        '庄河市'
    ],
    '黄冈': [
        '黄州区',
        '红安县',
        '黄梅县',
        '罗田县',
        '麻城市',
        '蕲春县',
        '武穴市',
        '英山县'
    ],
    '大理': [
        '大理市',
        '祥云县'
    ],
    '辽阳': [
        '白塔区',
        '辽阳县'
    ],
    '黄石': [
        '大冶市',
        '黄石港区',
        '下陆区',
        '阳新县'
    ],
    '龙岩': [
        '连城县',
        '新罗区',
        '上杭县',
        '武平县',
        '漳平市',
        '长汀县'
    ],
    '韶关': [
        '南雄市',
        '曲江区',
        '仁化县',
        '乳源瑶族自治县',
        '翁源县',
        '武江区',
        '浈江区'
    ],
    '荆州': [
        '公安县',
        '洪湖市',
        '江陵县',
        '监利县',
        '荆州区',
        '沙市',
        '石首市',
        '松滋市'
    ],
    '阳泉': [
        '城区',
        '郊区',
        '矿区',
        '平定县',
        '盂县'
    ],
    '长春': [
        '经济开发区',
        '绿园区',
        '净月区',
        '朝阳区',
        '德惠市',
        '二道区',
        '高新区',
        '九台市',
        '宽城区',
        '南关区',
        '农安县'
    ],
    '来宾': [
        '合山市',
        '象州县',
        '兴宾区'
    ],
    '天津': [
        '河西区',
        '宝坻区',
        '北辰区',
        '滨海新区',
        '大港区',
        '东丽区',
        '河北区',
        '河东区',
        '和平区',
        '红桥区',
        '蓟县',
        '静海县',
        '津南区',
        '开发区',
        '南开区',
        '塘沽区',
        '武清区',
        '西青区'
    ],
    '沈阳': [
        '大东区',
        '和平区',
        '皇姑区',
        '浑南新区',
        '沈北新区',
        '沈河区',
        '铁西区',
        '新民市',
        '于洪区'
    ],
    '文昌': [
        '文城镇',
        '文城镇',
        '文城镇'
    ],
    '抚顺': [
        '东洲区',
        '清原满族自治县',
        '顺城区',
        '望花区',
        '新抚区'
    ],
    '蚌埠': [
        '蚌山区',
        '固镇县',
        '怀远县',
        '龙子湖区',
        '五河县',
        '禹会区'
    ],
    '玉溪': [
        '峨山彝族自治县',
        '红塔区',
        '江川区',
        '通海县',
        '新平彝族傣族自治县',
        '易门县'
    ],
    '贺州': [
        '八步区',
        '昭平县'
    ],
    '黔西南': [
        '安龙县',
        '兴仁县'
    ],
    '葫芦岛': [
        '建昌县',
        '连山区',
        '龙港区',
        '绥中县',
        '兴城市'
    ],
    '新乡': [
        '封丘县',
        '凤泉区',
        '红旗区',
        '卫滨区',
        '卫辉市',
        '辉县',
        '原阳县',
        '长垣县'
    ],
    '漯河': [
        '临颍县',
        '舞阳县',
        '郾城区',
        '源汇区',
        '召陵区'
    ],
    '信阳': [
        '光山县',
        '淮滨县',
        '潢川县',
        '平桥区',
        '浉河区',
        '固始县'
    ],
    '四平': [
        '公主岭市',
        '梨树县',
        '双辽市',
        '铁东区',
        '铁西区',
        '伊通满族自治县'
    ],
    '临汾': [
        '古县',
        '洪洞县',
        '侯马市',
        '霍州市',
        '尧都区',
        '曲沃县',
        '襄汾县'
    ],
    '吐鲁番': [
        '吐鲁番市'
    ],
    '滨州': [
        '滨城区',
        '博兴县',
        '惠民县',
        '无棣县',
        '阳信县',
        '邹平县'
    ],
    '库尔勒': [
        '库尔勒市'
    ],
    '绵阳': [
        '安县',
        '北川羌族自治县',
        '涪城区',
        '江油市',
        '平武县',
        '三台县',
        '游仙区',
        '梓潼县'
    ],
    '金昌': [
        '金川区',
        '永昌县'
    ],
    '秦皇岛': [
        '北戴河区',
        '昌黎县',
        '海港区',
        '卢龙县',
        '青龙满族自治县'
    ],
    '通化': [
        '东昌区',
        '辉南县',
        '集安市',
        '经济开发区',
        '柳河县',
        '梅河口市'
    ],
    '常德': [
        '安乡县',
        '鼎城区',
        '汉寿县',
        '津市',
        '临澧县',
        '澧县',
        '石门县',
        '桃源县',
        '武陵区'
    ],
    '辽源': [
        '龙山区',
        '西安区'
    ],
    '茂名': [
        '电白县',
        '高州市',
        '化州市',
        '茂南区',
        '茂名市',
        '信宜市'
    ],
    '淄博': [
        '博山区',
        '高青县',
        '桓台县',
        '临淄区',
        '沂源县',
        '张店区',
        '周村区',
        '淄川区'
    ],
    '达州': [
        '达川区',
        '大竹县',
        '渠县',
        '通川区',
        '宣汉县'
    ],
    '莱芜': [
        '钢城区',
        '莱城区'
    ],
    '阳江': [
        '江城区',
        '阳春市',
        '阳东区',
        '阳西县'
    ],
    '楚雄': [
        '楚雄市',
        '武定县'
    ],
    '成都': [
        '成华区',
        '崇州市',
        '大邑县',
        '都江堰市',
        '高新区',
        '高新西区',
        '简阳市',
        '锦江区',
        '金牛区',
        '金堂县',
        '龙泉驿区',
        '彭州市',
        '郫县',
        '郫都区',
        '蒲江县',
        '青白江区',
        '青羊区',
        '邛崃市',
        '双流县',
        '温江区',
        '武侯区',
        '新都区',
        '新津县'
    ],
    '天水': [
        '甘谷县',
        '麦积区',
        '秦安县',
        '秦州区',
        '武山县',
        '张家川回族自治县'
    ],
    '克拉玛依': [
        '独山子区',
        '克拉玛依区'
    ],
    '广元': [
        '苍溪县',
        '剑阁县',
        '利州区'
    ],
    '常州': [
        '金坛市',
        '溧阳市',
        '天宁区',
        '武进区',
        '新北区',
        '钟楼区'
    ],
    '绥化': [
        '安达市',
        '北林区',
        '青冈县',
        '绥棱县',
        '望奎县'
    ],
    '宝鸡': [
        '陈仓区',
        '凤翔县',
        '扶风县',
        '金台区',
        '陇县',
        '眉县',
        '千阳县',
        '岐山县',
        '宝鸡市',
        '渭滨区'
    ],
    '周口': [
        '川汇区',
        '郸城县',
        '淮阳县',
        '鹿邑县',
        '商水县',
        '沈丘县',
        '太康县'
    ],
    '宁德': [
        '福安市',
        '福鼎市',
        '古田县',
        '蕉城区',
        '屏南县',
        '寿宁县',
        '霞浦县',
        '柘荣县'
    ],
    '鸡西': [
        '鸡冠区'
    ],
    '镇江': [
        '丹徒区',
        '丹阳市',
        '京口区',
        '句容市',
        '润州区',
        '镇江市',
        '扬中市'
    ],
    '白银': [
        '白银区',
        '会宁县',
        '景泰县',
        '靖远县',
        '平川区'
    ],
    '榆林': [
        '神木县',
        '绥德县',
        '榆阳区'
    ],
    '阜新': [
        '阜新蒙古族自治县',
        '海州区',
        '太平区',
        '细河区',
        '彰武县'
    ],
    '永州': [
        '道县',
        '东安县',
        '江华瑶族自治县',
        '江永县',
        '冷水滩区',
        '零陵区',
        '宁远县',
        '祁阳县',
        '新田县'
    ],
    '肇庆': [
        '德庆县',
        '鼎湖区',
        '端州区',
        '高要市',
        '广宁县',
        '怀集县',
        '四会市'
    ],
    '东莞': [
        '常平镇',
        '茶山镇',
        '大朗镇',
        '大岭山镇',
        '东城区',
        '东莞市',
        '东坑镇',
        '凤岗镇',
        '莞城区',
        '厚街镇',
        '黄江镇',
        '虎门镇',
        '寮步镇',
        '南城区',
        '清溪镇',
        '企石镇',
        '沙田镇',
        '石碣镇',
        '石龙镇',
        '石排镇',
        '松山湖区',
        '塘厦镇',
        '望牛墩镇',
        '万江区',
        '长安镇',
        '樟木头镇',
        '中堂镇'
    ],
    '双鸭山': [
        '尖山区'
    ],
    '万宁': [
        '万宁市'
    ],
    '阿克苏': [
        '阿克苏市'
    ],
    '郑州': [
        '二七区',
        '高新区',
        '巩义市',
        '管城回族区',
        '航空港区',
        '惠济区',
        '金水区',
        '荥阳市',
        '新郑市',
        '郑东新区',
        '中牟县',
        '中原区'
    ],
    '泸州': [
        '合江县',
        '江阳区',
        '龙马潭区',
        '泸县',
        '纳溪区',
        '叙永县'
    ],
    '德阳': [
        '广汉市',
        '旌阳区',
        '什邡市',
        '中江县'
    ],
    '德州': [
        '德城区',
        '乐陵市',
        '陵县',
        '临邑县',
        '宁津县',
        '齐河县',
        '夏津县'
    ],
    '兰州': [
        '安宁区',
        '城关区',
        '皋兰县',
        '七里河区',
        '兰州市',
        '西固区',
        '永登县',
        '榆中县'
    ],
    '盐城': [
        '滨海县',
        '城南新区',
        '大丰市',
        '东台市',
        '阜宁县',
        '建湖县',
        '射阳县',
        '亭湖区',
        '响水县',
        '盐城市',
        '盐都区'
    ],
    '玉林': [
        '北流市',
        '博白县',
        '陆川县',
        '容县',
        '兴业县',
        '玉州区'
    ],
    '上海': [
        '普陀区',
        '浦东新区',
        '杨浦区',
        '奉贤区',
        '长宁区',
        '嘉定区',
        '闵行区',
        '闸北区',
        '宝山区',
        '松江区',
        '徐汇区',
        '黄浦区',
        '崇明县',
        '虹口区',
        '静安区',
        '金山区',
        '卢湾区',
        '青浦区'
    ],
    '佳木斯': [
        '富锦市',
        '抚远县',
        '桦南县',
        '前进区',
        '同江市',
        '向阳区'
    ],
    '湘潭': [
        '湘潭县',
        '湘乡市',
        '岳塘区',
        '雨湖区'
    ],
    '牡丹江': [
        '东安区',
        '海林市',
        '穆棱市',
        '西安区'
    ],
    '北京': [
        '朝阳区',
        '海淀区',
        '大兴区',
        '丰台区',
        '东城区',
        '顺义区',
        '石景山区',
        '昌平区',
        '崇文区',
        '房山区',
        '怀柔区',
        '门头沟区',
        '密云区',
        '平谷区',
        '通州区',
        '西城区',
        '延庆区'
    ],
    '洛阳': [
        '瀍河回族区',
        '吉利区',
        '老城区',
        '栾川县',
        '洛龙区',
        '洛宁县',
        '涧西区',
        '孟津县',
        '嵩县',
        '西工区',
        '偃师市',
        '伊川县'
    ],
    '汉中': [
        '城固县',
        '佛坪县',
        '汉台区',
        '略阳县',
        '勉县',
        '西乡县',
        '洋县',
        '镇巴县'
    ],
    '新密': [
        '新密市'
    ],
    '徐州': [
        '丰县',
        '鼓楼区',
        '贾汪区',
        '沛县',
        '邳州市',
        '泉山区',
        '睢宁县',
        '铜山区',
        '新沂市',
        '云龙区'
    ],
    '九江': [
        '都昌县',
        '共青城市',
        '湖口县',
        '九江县',
        '开发区',
        '濂溪区',
        '庐山区',
        '瑞昌市',
        '武宁县',
        '修水县',
        '浔阳区',
        '永修县'
    ],
    '丽水': [
        '景宁畲族自治县',
        '缙云县',
        '莲都区',
        '龙泉市',
        '青田县',
        '松阳县',
        '遂昌县',
        '云和县'
    ],
    '淮安': [
        '淮安区',
        '淮阴区',
        '金湖县',
        '开发区',
        '涟水县',
        '清河区',
        '清浦区',
        '淮安市',
        '盱眙县'
    ],
    '金华': [
        '东阳市',
        '金东区',
        '兰溪市',
        '磐安县',
        '浦江县',
        '金华市',
        '婺城区',
        '武义县',
        '义乌市',
        '永康市'
    ],
    '芜湖': [
        '弋江区',
        '繁昌县',
        '镜湖区',
        '鸠江区',
        '南陵县',
        '芜湖县',
        '无为县'
    ],
    '咸阳': [
        '彬县',
        '泾阳县',
        '秦都区',
        '三原县',
        '渭城区',
        '武功县',
        '西咸新区',
        '杨凌区',
        '长武县'
    ],
    '海东': [
        '平安县'
    ],
    '邯郸': [
        '成安县',
        '磁县',
        '丛台区',
        '峰峰矿区',
        '复兴区',
        '邯郸县',
        '邯山区',
        '鸡泽县',
        '临漳县',
        '邱县',
        '魏县',
        '武安市',
        '永年县'
    ],
    '黄山': [
        '徽州区',
        '歙县',
        '屯溪区',
        '休宁县'
    ],
    '广州': [
        '荔湾区',
        '黄埔区',
        '天河区',
        '白云区',
        '越秀区',
        '海珠区',
        '从化区',
        '番禺区',
        '花都区',
        '萝岗区',
        '南沙区',
        '增城区'
    ],
    '广安': [
        '广安区',
        '邻水县',
        '武胜县',
        '岳池县'
    ],
    '海南州': [
        '共和恰卜恰镇'
    ],
    '乌兰察布': [
        '丰镇市',
        '化德县',
        '集宁区',
        '四子王旗'
    ],
    '苏州': [
        '沧浪区',
        '常熟市',
        '工业园区',
        '姑苏区',
        '虎丘区',
        '昆山',
        '苏州市',
        '太仓市',
        '吴江区',
        '吴中区',
        '相城区',
        '张家港市'
    ],
    '石家庄': [
        '藁城市',
        '栾城区',
        '鹿泉区',
        '平山县',
        '桥西区',
        '深泽县',
        '无极县',
        '行唐县',
        '新华区',
        '辛集市',
        '新乐市',
        '元氏县',
        '裕华区',
        '长安区',
        '正定县'
    ],
    '株洲': [
        '茶陵县',
        '荷塘区',
        '醴陵市',
        '芦淞区',
        '石峰区',
        '天元区',
        '攸县',
        '株洲县'
    ],
    '孝感': [
        '安陆市',
        '大悟县',
        '汉川市',
        '孝昌县',
        '孝南区',
        '云梦县'
    ],
    '安阳': [
        '北关区',
        '林州市',
        '汤阴县',
        '文峰区',
        '新城区',
        '殷都区'
    ],
    '合肥': [
        '包河区',
        '巢湖市',
        '肥东县',
        '肥西县',
        '庐江县',
        '庐阳区',
        '蜀山区',
        '瑶海区',
        '长丰县'
    ],
    '本溪': [
        '明山区',
        '平山区'
    ],
    '临沂': [
        '苍山县',
        '东城新区',
        '费县',
        '河东区',
        '莒南县',
        '兰山区',
        '临沭县',
        '罗庄区',
        '蒙阴县',
        '郯城县',
        '沂南县',
        '沂水县'
    ],
    '三亚': [
        '海棠湾区',
        '三亚市'
    ],
    '潜江': [
        '潜江市'
    ],
    '济南': [
        '高新区',
        '槐荫区',
        '济阳县',
        '历城区',
        '历下区',
        '平阴县',
        '商河县',
        '济南市',
        '天桥区',
        '长清区',
        '章丘市'
    ],
    '南充': [
        '高坪区',
        '嘉陵区',
        '阆中市',
        '南部县',
        '蓬安县',
        '顺庆区',
        '西充县',
        '仪陇县',
        '营山县'
    ],
    '东营': [
        '东营区',
        '广饶县',
        '垦利县',
        '利津县'
    ],
    '焦作': [
        '解放区',
        '孟州市',
        '沁阳市',
        '山阳区',
        '温县',
        '武陟县',
        '修武县'
    ],
    '汕尾': [
        '城区',
        '海丰县',
        '陆丰市'
    ],
    '沧州': [
        '东光县',
        '河间市',
        '黄骅市',
        '青县',
        '任丘市',
        '肃宁县',
        '献县',
        '运河区'
    ],
    '三明': [
        '大田县',
        '建宁县',
        '梅列区',
        '明溪县',
        '宁化县',
        '三元区',
        '沙县',
        '永安市',
        '尤溪县'
    ],
    '银川': [
        '贺兰县',
        '金凤区',
        '银川市',
        '兴庆区',
        '西夏区'
    ],
    '乌鲁木齐': [
        '米东区',
        '沙依巴克区',
        '乌鲁木齐市',
        '水磨沟区',
        '天山区',
        '新市'
    ],
    '梧州': [
        '岑溪市',
        '龙圩区',
        '蒙山县',
        '藤县',
        '万秀区',
        '长洲区'
    ],
    '琼海': [
        '嘉积区'
    ],
    '济源': [
        '济源市'
    ],
    '巴中': [
        '巴州区',
        '通江县'
    ],
    '攀枝花': [
        '东区',
        '米易县',
        '盐边县'
    ],
    '盘锦': [
        '大洼县',
        '兴隆台区'
    ],
    '襄阳': [
        '樊城区',
        '谷城县',
        '老河口市',
        '南漳县',
        '襄城区',
        '襄州区',
        '宜城市',
        '枣阳市'
    ],
    '丽江': [
        '古城区',
        '玉龙纳西族自治县'
    ],
    '白山': [
        '八道江区',
        '抚松县',
        '江源区',
        '白山市'
    ],
    '晋城': [
        '城区',
        '高平市',
        '陵川县',
        '沁水县',
        '阳城县'
    ],
    '遵义': [
        '道真仡佬族苗族自治县',
        '凤冈县',
        '红花岗区',
        '汇川区',
        '桐梓县',
        '遵义县'
    ],
    '廊坊': [
        '霸州市',
        '广阳区',
        '固安县',
        '三河市',
        '文安县',
        '香河县'
    ],
    '益阳': [
        '安化县',
        '高新区',
        '赫山区',
        '南县',
        '桃江县',
        '沅江市'
    ],
    '宜宾': [
        '翠屏区',
        '珙县',
        '江安县',
        '南溪区',
        '屏山县',
        '兴文县',
        '宜宾县',
        '筠连县',
        '长宁县'
    ],
    '文山': [
        '文山市'
    ],
    '海口': [
        '龙华区',
        '澄迈县',
        '美兰区',
        '琼山区',
        '屯昌县',
        '秀英区'
    ],
    '乌海': [
        '海勃湾区',
        '海南区'
    ],
    '潍坊': [
        '安丘市',
        '昌乐县',
        '昌邑市',
        '高密市',
        '高新区',
        '奎文区',
        '临朐县',
        '青州市',
        '潍坊市',
        '寿光市',
        '潍城区',
        '诸城市'
    ],
    '汕头': [
        '潮南区',
        '潮阳区',
        '澄海区',
        '濠江区',
        '金平区',
        '龙湖区'
    ],
    '江门': [
        '恩平市',
        '鹤山市',
        '江海区',
        '开平市',
        '蓬江区',
        '台山市',
        '新会区'
    ],
    '珠海': [
        '香洲区',
        '斗门区',
        '金湾区'
    ],
    '巴彦淖尔': [
        '临河区'
    ],
    '武威': [
        '凉州区',
        '天祝藏族自治县'
    ],
    '安顺': [
        '普定县',
        '西秀区',
        '镇宁布依族苗族自治县'
    ],
    '柳州': [
        '城中区',
        '柳北区',
        '柳城县',
        '柳江县',
        '柳南区',
        '鹿寨县',
        '融水苗族自治县',
        '三江侗族自治县',
        '鱼峰区'
    ],
    '云浮': [
        '罗定市',
        '云城区'
    ],
    '承德': [
        '承德县',
        '双滦区',
        '双桥区',
        '围场满族蒙古族自治县'
    ],
    '抚州': [
        '东乡县',
        '金溪县',
        '黎川县',
        '临川区',
        '南城县'
    ],
    '通辽': [
        '科尔沁',
        '库伦旗库伦镇',
        '扎鲁特旗鲁北镇'
    ],
    '海西': [
        '德令哈市',
        '格尔木市'
    ],
    '湛江': [
        '赤坎区',
        '开发区',
        '雷州市',
        '廉江市',
        '遂溪县',
        '吴川市',
        '霞山区'
    ],
    '青岛': [
        '城阳区',
        '黄岛区',
        '胶州市',
        '即墨市',
        '莱西市',
        '崂山区',
        '李沧区',
        '平度市',
        '青岛市'
    ],
    '安康': [
        '汉滨区',
        '旬阳县'
    ],
    '齐齐哈尔': [
        '建华区',
        '龙江县',
        '龙沙区'
    ],
    '新余': [
        '分宜县',
        '渝水区'
    ],
    '衢州': [
        '常山县',
        '江山市',
        '开化县',
        '柯城区',
        '龙游县',
        '衢江区'
    ],
    '宿州': [
        '灵璧县',
        '泗县',
        '萧县',
        '埇桥区'
    ],
    '三门峡': [
        '湖滨区',
        '灵宝市',
        '渑池县'
    ],
    '杭州': [
        '拱墅区',
        '下城区',
        '滨江区',
        '淳安县',
        '富阳市',
        '建德市',
        '江干区',
        '临安市',
        '上城区',
        '桐庐县',
        '萧山区',
        '下沙经济开发区',
        '西湖区',
        '余杭区'
    ],
    '昌江': [
        '石碌镇'
    ],
    '淮北': [
        '濉溪县',
        '相山区'
    ],
    '平顶山': [
        '宝丰县',
        '鲁山县',
        '汝州市',
        '卫东区',
        '新华区'
    ],
    '重庆': [
        '巴南区',
        '北碚区',
        '北部新区',
        '璧山区',
        '江北区',
        '万州区',
        '开县',
        '綦江县',
        '大渡口区',
        '大足区',
        '垫江县',
        '丰都县',
        '奉节县',
        '涪陵区',
        '合川区',
        '江津区',
        '九龙坡区',
        '两江新区',
        '梁平县',
        '南岸区',
        '南川区',
        '黔江区',
        '荣昌区',
        '沙坪坝区',
        '石柱土家族自治县',
        '石柱县',
        '铜梁区',
        '潼南区',
        '巫山县',
        '永川区',
        '酉阳土家族苗族自治县',
        '渝北区',
        '云阳县',
        '渝中区',
        '长寿区',
        '忠县'
    ],
    '南昌': [
        '东湖区',
        '红谷滩新区',
        '进贤县',
        '南昌县',
        '青山湖区',
        '青云谱区',
        '湾里区',
        '西湖区',
        '新建县'
    ],
    '朝阳': [
        '北票市',
        '双塔区'
    ],
    '松原': [
        '扶余市',
        '宁江区',
        '前郭尔罗斯蒙古族自治县',
        '长岭县'
    ],
    '宜春': [
        '丰城市',
        '奉新县',
        '高安市',
        '上高县',
        '宜丰县',
        '袁州区'
    ],
    '昭通': [
        '镇雄县'
    ],
    '吕梁': [
        '汾阳市',
        '交城县',
        '离石区',
        '文水县',
        '孝义市'
    ],
    '南宁': [
        '宾阳县',
        '横县',
        '江南区',
        '良庆区',
        '隆安县',
        '马山县',
        '青秀区',
        '兴宁区',
        '西乡塘区',
        '邕宁区'
    ],
    '佛山': [
        '南海区',
        '高明区',
        '三水区',
        '禅城区',
        '顺德区'
    ],
    '昌吉': [
        '昌吉市',
        '吉木萨尔县'
    ],
    '湘西': [
        '凤凰县',
        '花垣县',
        '吉首市',
        '龙山县',
        '永顺县'
    ],
    '西双版纳': [
        '景洪市',
        '勐海县',
        '勐腊县'
    ],
    '呼和浩特': [
        '和林格尔县',
        '回民区',
        '清水河县',
        '赛罕区',
        '呼和浩特市',
        '托克托县',
        '新城区',
        '玉泉区'
    ],
    '锦州': [
        '古塔区',
        '黑山县',
        '凌河区',
        '太和区'
    ],
    '揭阳': [
        '东山区',
        '惠来县',
        '揭东区',
        '普宁市',
        '榕城区'
    ],
    '宜昌': [
        '长阳土家族自治县',
        '当阳市',
        '五峰土家族自治县',
        '伍家岗区',
        '西陵区',
        '猇亭区',
        '宜都市',
        '夷陵区',
        '远安县',
        '枝江市'
    ],
    '扬州': [
        '宝应县',
        '高邮市',
        '广陵区',
        '邗江区',
        '江都区',
        '仪征市'
    ],
    '滁州': [
        '定远县',
        '来安县',
        '琅琊区',
        '明光市',
        '南谯区',
        '全椒县',
        '天长市'
    ],
    '白城': [
        '洮北区',
        '洮南市',
        '镇赉县'
    ],
    '忻州': [
        '定襄县',
        '忻府区',
        '原平市'
    ],
    '萍乡': [
        '安源区'
    ]
};